base-case/curiosityFluidsAirfoilMesher/airfoil-test/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          305450;
        startFace       304702;
    }
    farfield
    {
        type            patch;
        nFaces          1155;
        startFace       610152;
    }
    airfoil
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          341;
        startFace       611307;
    }
)

// ************************************************************************* //
