base-case/curiosityFluidsAirfoilMesher/airfoil-test/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
304702
(
0.00183073
-0.00375056
-0.00188958
0.00189984
-0.00379715
0.00176736
-0.00388016
0.00182307
...
)
;

boundaryField
{
    frontAndBack
    {
        type            empty;
        value           nonuniform 0();
    }
    farfield
    {
        type            calculated;
        value           nonuniform List<scalar> 
1155
(
-2.33053
-1.76379
-1.43605
-1.26067
-1.12311
-0.978034
-0.818929
-0.65705
...
)
;
    }
    airfoil
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
