base-case/curiosityFluidsAirfoilMesher/airfoil-test/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-09;
        relTol          0.001;
        smoother        GaussSeidel;
        maxIter         100;
    }

    Phi
    {
        $p
    }

    U 
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        nSweeps         2;
        tolerance       1e-08;
        relTol          0.1;
        minIter         1;
    }

    "(nuTilda|R|gamma)"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        nSweeps         2;
        tolerance       1e-08;
        relTol          0.1;
    }
}

potentialFlow
{
    nNonOrthogonalCorrectors 10;
}


SIMPLE
{
    nNonOrthogonalCorrectors 0;

    residualControl
    {
        p               1e-8;
        U               1e-8;
        nuTilda         1e-8;
    }
}

relaxationFactors
{
    fields
    {
        p               0.3;
    }
    equations
    {
        U               0.7;
        nuTilda         0.7;
        R               0.7;
        gamma               0.7;
    }
}


// ************************************************************************* //
